In [1]:
import pandas as pd

In [2]:
#Creating Data
data = {
    "Name": ["Arin", "Rishita", "Vaishnavi", "Advik", "Vishal", "Radhika"],
    "Grade": [65, 99, 84, 68, 86, 88],
    "State": ["Uttar Pradesh", "Gujarat", "Haryana","Uttarakhand", "Uttarakhand", "Madhya Pradesh"],
    "Gender": ["Male", "Female", "Female", "Male","Male", "Female"],
    "Salary": [60000, 950000, 40000, 20000, 10000, 65000]
}
df = pd.DataFrame(data)
df

        Name  Grade           State  Gender  Salary
0       Arin     65   Uttar Pradesh    Male   60000
1    Rishita     99         Gujarat  Female  950000
2  Vaishnavi     84         Haryana  Female   40000
3      Advik     68     Uttarakhand    Male   20000
4     Vishal     86     Uttarakhand    Male   10000
5    Radhika     88  Madhya Pradesh  Female   65000

In [3]:
df["Bonus"] = df['Salary'] * 0.1 #added column Bonus
df

        Name  Grade           State  Gender  Salary    Bonus
0       Arin     65   Uttar Pradesh    Male   60000   6000.0
1    Rishita     99         Gujarat  Female  950000  95000.0
2  Vaishnavi     84         Haryana  Female   40000   4000.0
3      Advik     68     Uttarakhand    Male   20000   2000.0
4     Vishal     86     Uttarakhand    Male   10000   1000.0
5    Radhika     88  Madhya Pradesh  Female   65000   6500.0

In [4]:
#df.insert(location, column-name, data)
df.insert(1, "ID Number", [25, 27, 18, 22, 21, 31]) 
df

        Name  ID Number  Grade           State  Gender  Salary    Bonus
0       Arin         25     65   Uttar Pradesh    Male   60000   6000.0
1    Rishita         27     99         Gujarat  Female  950000  95000.0
2  Vaishnavi         18     84         Haryana  Female   40000   4000.0
3      Advik         22     68     Uttarakhand    Male   20000   2000.0
4     Vishal         21     86     Uttarakhand    Male   10000   1000.0
5    Radhika         31     88  Madhya Pradesh  Female   65000   6500.0

In [5]:
#update a column value
df.loc[0, "Salary"] = 90000
df

        Name  ID Number  Grade           State  Gender  Salary    Bonus
0       Arin         25     65   Uttar Pradesh    Male   90000   6000.0
1    Rishita         27     99         Gujarat  Female  950000  95000.0
2  Vaishnavi         18     84         Haryana  Female   40000   4000.0
3      Advik         22     68     Uttarakhand    Male   20000   2000.0
4     Vishal         21     86     Uttarakhand    Male   10000   1000.0
5    Radhika         31     88  Madhya Pradesh  Female   65000   6500.0

In [6]:
#increase salary by 5%
df['Salary'] = df['Salary'] * 1.05
df

        Name  ID Number  Grade           State  Gender    Salary    Bonus
0       Arin         25     65   Uttar Pradesh    Male   94500.0   6000.0
1    Rishita         27     99         Gujarat  Female  997500.0  95000.0
2  Vaishnavi         18     84         Haryana  Female   42000.0   4000.0
3      Advik         22     68     Uttarakhand    Male   21000.0   2000.0
4     Vishal         21     86     Uttarakhand    Male   10500.0   1000.0
5    Radhika         31     88  Madhya Pradesh  Female   68250.0   6500.0

In [7]:
#To drop a column
df.drop('Bonus', axis=1, inplace=True)
print(df)

        Name  ID Number  Grade           State  Gender    Salary
0       Arin         25     65   Uttar Pradesh    Male   94500.0
1    Rishita         27     99         Gujarat  Female  997500.0
2  Vaishnavi         18     84         Haryana  Female   42000.0
3      Advik         22     68     Uttarakhand    Male   21000.0
4     Vishal         21     86     Uttarakhand    Male   10500.0
5    Radhika         31     88  Madhya Pradesh  Female   68250.0

## Handling Missinng data

In [8]:
#Creating Data
data = {
    "Name": ["Arin", "Rishita", "Vaishnavi", "Advik", "Vishal", "Radhika"],
    "Grade": [None, 99, 84, 68, 86, 88],
    "State": ["Uttar Pradesh", None, "Haryana","Uttarakhand", "Uttarakhand", "Madhya Pradesh"],
    "Gender": ["Male", "Female", None, "Male","Male", "Female"],
    "Salary": [60000, 950000, 40000, None, 10000, 65000]
}
df = pd.DataFrame(data)
df

        Name  Grade           State  Gender    Salary
0       Arin    NaN   Uttar Pradesh    Male   60000.0
1    Rishita   99.0            None  Female  950000.0
2  Vaishnavi   84.0         Haryana    None   40000.0
3      Advik   68.0     Uttarakhand    Male       NaN
4     Vishal   86.0     Uttarakhand    Male   10000.0
5    Radhika   88.0  Madhya Pradesh  Female   65000.0

In [9]:
df.isnull() #return true if value is missing

    Name  Grade  State  Gender  Salary
0  False   True  False   False   False
1  False  False   True   False   False
2  False  False  False    True   False
3  False  False  False   False    True
4  False  False  False   False   False
5  False  False  False   False   False

In [10]:
df.isnull().sum() #return count of value if it is missing

Name      0
Grade     1
State     1
Gender    1
Salary    1
dtype: int64

In [11]:
#update missing with zero
df.fillna(0, inplace=True)
df

        Name  Grade           State  Gender    Salary
0       Arin    0.0   Uttar Pradesh    Male   60000.0
1    Rishita   99.0               0  Female  950000.0
2  Vaishnavi   84.0         Haryana       0   40000.0
3      Advik   68.0     Uttarakhand    Male       0.0
4     Vishal   86.0     Uttarakhand    Male   10000.0
5    Radhika   88.0  Madhya Pradesh  Female   65000.0

In [12]:
#Remove if data is missing
df.dropna(axis=1, inplace=True)
df

        Name  Grade           State  Gender    Salary
0       Arin    0.0   Uttar Pradesh    Male   60000.0
1    Rishita   99.0               0  Female  950000.0
2  Vaishnavi   84.0         Haryana       0   40000.0
3      Advik   68.0     Uttarakhand    Male       0.0
4     Vishal   86.0     Uttarakhand    Male   10000.0
5    Radhika   88.0  Madhya Pradesh  Female   65000.0

#### Sorting & aggregation

In [13]:
#Creating Data
data = {
    "Name": ["Arin", "Rishita", "Vaishnavi", "Advik", "Vishal", "Radhika"],
    "Grade": [65, 99, 84, 68, 86, 88],
    "State": ["Uttar Pradesh", "Gujarat", "Haryana","Uttarakhand", "Uttarakhand", "Madhya Pradesh"],
    "Gender": ["Male", "Female", "Female", "Male","Male", "Female"],
    "Salary": [60000, 950000, 40000, 20000, 10000, 65000]
}
df = pd.DataFrame(data)
df

        Name  Grade           State  Gender  Salary
0       Arin     65   Uttar Pradesh    Male   60000
1    Rishita     99         Gujarat  Female  950000
2  Vaishnavi     84         Haryana  Female   40000
3      Advik     68     Uttarakhand    Male   20000
4     Vishal     86     Uttarakhand    Male   10000
5    Radhika     88  Madhya Pradesh  Female   65000

In [14]:
#sorted in descending based on grade
df.sort_values(by="Grade", ascending=False, inplace=True)
df

        Name  Grade           State  Gender  Salary
1    Rishita     99         Gujarat  Female  950000
5    Radhika     88  Madhya Pradesh  Female   65000
4     Vishal     86     Uttarakhand    Male   10000
2  Vaishnavi     84         Haryana  Female   40000
3      Advik     68     Uttarakhand    Male   20000
0       Arin     65   Uttar Pradesh    Male   60000

In [15]:
#sorted in ascending based on grade
df.sort_values(by="Grade", ascending=True, inplace=True)
df

        Name  Grade           State  Gender  Salary
0       Arin     65   Uttar Pradesh    Male   60000
3      Advik     68     Uttarakhand    Male   20000
2  Vaishnavi     84         Haryana  Female   40000
4     Vishal     86     Uttarakhand    Male   10000
5    Radhika     88  Madhya Pradesh  Female   65000
1    Rishita     99         Gujarat  Female  950000

In [16]:
average_salary = df['Salary'].mean()
average_salary

np.float64(190833.33333333334)

In [17]:
grouped = df.groupby("Grade")['Salary'].sum()
grouped

Grade
65     60000
68     20000
84     40000
86     10000
88     65000
99    950000
Name: Salary, dtype: int64

In [18]:
grouped = df.groupby(["Grade", "Name"])['Salary'].sum()
grouped

Grade  Name
65     Arin          60000
68     Advik         20000
84     Vaishnavi     40000
86     Vishal        10000
88     Radhika       65000
99     Rishita      950000
Name: Salary, dtype: int64

#### Merging and Concatenation

In [19]:
customers = pd.DataFrame({
    "CustomerID": [1, 2, 3, 4],
    "Name": ["Ram", "Raju", "Mohan", "Shiv"]
})

In [20]:
orders = pd.DataFrame({
    "CustomerID":[1, 2, 3, 4],
    "Amount": [250, 500, 750, 100]
})

In [21]:
merged_df = pd.merge(customers, orders, on="CustomerID", how="inner")
merged_df

   CustomerID   Name  Amount
0           1    Ram     250
1           2   Raju     500
2           3  Mohan     750
3           4   Shiv     100

In [22]:
merged_df = pd.merge(customers, orders, on="CustomerID", how="left")
merged_df

   CustomerID   Name  Amount
0           1    Ram     250
1           2   Raju     500
2           3  Mohan     750
3           4   Shiv     100

In [23]:
customers_df1 = pd.DataFrame({
    "CustomerID": [1, 2, 3],
    "Name": ["Ram", "Narayan", "Shiv"]
})

In [24]:
customers_df2 = pd.DataFrame({
    "CustomerID": [5, 6, 7],
    "Name": ["Sita", "Lakshmi", "Parvati"]
})

In [25]:
#vertically
concatenate = pd.concat([customers_df1, customers_df2], ignore_index=True)
concatenate

   CustomerID     Name
0           1      Ram
1           2  Narayan
2           3     Shiv
3           5     Sita
4           6  Lakshmi
5           7  Parvati

In [26]:
#horizontally
concatenate = pd.concat([customers_df1, customers_df2], axis=1, ignore_index=True)
concatenate

   0        1  2        3
0  1      Ram  5     Sita
1  2  Narayan  6  Lakshmi
2  3     Shiv  7  Parvati